import { FunctionComponent } from "react";
import vOnclickLogo from "../../images/vOnclick-logo.png";

const About: FunctionComponent<object> = () => {
  return (
    <>
      <div className="about-container text-center mb-5 py-3" dir="rtl">
        <img className="vOnclick-logo" src={vOnclickLogo} alt="Bcard-logo" />
        <h1 className="display-1">אודות "חופשה בקליק"</h1>
        <p className="display-6">
          ברוכים הבאים ל"חופשה בקליק" – השער שלכם לעולם האירוח הישראלי! בעידן
          שבו הזמן יקר והחיפוש אחר החופשה המושלמת יכול להיות מורכב, "חופשה
          בקליק" הוקמה במטרה לפשט את התהליך ולאפשר לכם למצוא את מקום האירוח הבא
          שלכם בקלות, במהירות ובהתאמה מדויקת לצרכים שלכם. אנו מאמינים שלכל אחד
          מגיע ליהנות מאירוח איכותי, והמשימה שלנו היא לחבר אתכם עם בתי האירוח
          הטובים ביותר בישראל.
        </p>

        <h1 className="display-1">מה אנחנו מציעים?</h1>
        <p className="display-6">
          🔹<span className="fw-bold">מגוון רחב של אפשרויות אירוח –</span>
          <br /> אצלנו תמצאו הכל, החל מצימרים כפריים וציוריים, דרך מלונות בוטיק
          יוקרתיים ועד וילות מפנקות המתאימות למשפחות וקבוצות.
          <br /> 🔹 <span className="fw-bold">חיפוש חכם וממוקד –</span> <br />
          המערכת שלנו מאפשרת לכם לסנן מודעות לפי אזור, מחיר, סוג אירוח ומגוון
          פיצ'רים נוספים, כדי למצוא בדיוק את מה שאתם מחפשים. <br />
          🔹 <span className="fw-bold">קהילה וחיבורים – –</span> <br />
          "חופשה בקליק" היא לא רק לוח מודעות, אלא גם פלטפורמה שמחברת בין בעלי
          מקומות אירוח לבין לקוחות פוטנציאליים, ומייצרת חיבורים חדשים
          ומשמעותיים. <br />
          🔹 <span className="fw-bold">נוחות שימוש מרבית –</span>
          <br /> הממשק שלנו פשוט ואינטואיטיבי, ומאפשר לכם לגלוש בין המודעות,
          ליצור קשר עם בעלי המקום ולבצע הזמנות בצורה קלה ונוחה, מכל מכשיר ומכל
          מקום.
        </p>
        <h1 className="display-1">למה כדאי להצטרף אלינו?</h1>
        <p className="display-6">
          ✅ <span className="fw-bold">חשיפה מקסימלית –</span>
          <br /> אם אתם בעלי מקום אירוח, אנו מעניקים לכם פלטפורמה איכותית להצגת
          העסק שלכם בפני קהל רחב. <br />✅
          <span className="fw-bold">חיסכון בזמן ובמשאבים –</span> <br /> Say בין
          אם אתם מחפשים חופשה או מציעים מקום אירוח, אנחנו חוסכים לכם זמן יקר על
          ידי ריכוז כל המידע במקום אחד. <br />✅
          <span className="fw-bold">חוויית משתמש מושלמת –</span>
          <br /> העיצוב המודרני והקריא שלנו מבטיח לכל גולש חוויה נעימה ויעילה.
          <br />
          <span className="fw-bold">
            אנו מזמינים אתכם להצטרף לקהילה שלנו ולמצוא את החופשה הבאה שלכם עוד
            היום!
          </span>
        </p>
      </div>
    </>
  );
};

export default About;
